JayHeng/cortex-m-apps/apps/memtester_imxrt1062/src/main.c
/*
 * The Clear BSD License
 * Copyright (c) 2013 - 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 *  that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "board.h"
#include "app.h"
#include "memtester.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
typedef struct _semc_test_config {
  uint32_t baseAddr;
  uint32_t testSize;
  uint32_t loopNum;
  uint32_t dramFreq;
  uint32_t enableCache;
} semc_test_config_t;

int fail_stop = 1;
   
/*******************************************************************************
 * Code
 ******************************************************************************/
/*!
 * @brief Main function
 */
int main(void)
{
    char memsuffix = 'B';
    /* Init board hardware. */
    BOARD_InitHardware();

    /* --------------- stress test --------------- */
    semc_test_config_t testConfig;
    testConfig.baseAddr = 0x80000000;
    testConfig.testSize = 64 * 1024;
    testConfig.loopNum = 1;
    testConfig.dramFreq = CLOCK_GetFreq(kCLOCK_SemcClk);
    testConfig.enableCache = 0;
    
    if (!testConfig.enableCache) {
        /* Disable D cache */
        SCB_DisableDCache();
    }

    PRINTF("\r\n########## Print out from target board ##########\r\n");
    PRINTF("\r\nSDRAM r/w test settings:\r\n");
    PRINTF("      Base Addr: 0x%x;\r\n", testConfig.baseAddr);
    PRINTF("      Test Size: %d Bytes;\r\n", testConfig.testSize);
    PRINTF("      Test Loop: %d;\r\n", testConfig.loopNum);    
    PRINTF("      SDRAM Freq: %d Hz;\r\n",testConfig.dramFreq);
    PRINTF("      Enable Cache: %d;\r\n\r\n", testConfig.enableCache);

    /* Run memory stress test: 64KByte, loop=1, page_size = 1kbyte */
    memtester_main(testConfig.baseAddr, testConfig.testSize, &memsuffix, testConfig.loopNum, (1*1024));

    while (1)
    {
    }
}
